#include <stdio.h>
#include <locale.h>

int main()
{
    char *locale = setlocale(LC_ALL, "");

    while (1){
        printf("\n------------------\n");
        printf("\n 1. Начать\n");
        printf(" 2. Правила\n");
        printf(" 3. Выход\n");

        int num;
        printf("\n------------------");
        printf("\n Выберите пункт: ");
        scanf("%d", &num);

        system("cls");

        int numbers[13] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13};
        int count[13] = {0};

        int game_field[5][5] = {0};
        int num_field = 0;

        int row, col;

        switch(num){
            case 1:
                srand(time(NULL));

                while (num_field < 25){

                    printf("\n");
                    for (int i = 0; i < 5; i++) {
                        printf("\n");
                        for (int j = 0; j < 5; j++) {
                            printf("     %d", game_field[i][j]);
                        }
                        printf("\n");
                        printf("\n");
                    }

                    int ind_num = rand() % 13;

                    if (count[ind_num] < 4) {
                        printf("\n %d\n", numbers[ind_num]);
                        count[ind_num]++;
                    }

                    int num1 = ind_num;

                    while (1){
                        printf("\n Введите номер строки (от 1 до 5): ");
                        scanf("%d", &row);
                        printf(" Введите номер столбца (от 1 до 5): ");
                        scanf("%d", &col);

                        if (row < 1 || row > 5 || col < 1 || col > 5) {
                            printf("\n Неверные координаты! Попробуйте снова.\n");
                            continue;
                        }else if (game_field[row-1][col-1] > 0) {
                            printf("\n Выбранная ячейка уже занята!\n");
                            continue;
                        }else{
                            break;
                        }
                    }

                    game_field[row-1][col-1] = num1 + 1;
                    num_field++;

                    system("cls");
                }

                printf("\n");
                for (int i = 0; i < 5; i++) {
                    printf("\n");
                    for (int j = 0; j < 5; j++) {
                        printf("     %d ", game_field[i][j]);
                    }
                    printf("\n");
                    printf("\n");
                }

                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n Комбинации чисел                                                        В ряду или столбце       По диагонали");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 2 одинаковых числа                                                             10 очков           20 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 2 пары одинаковых чисел                                                        20 очков           30 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 3 одинаковых числа                                                             40 очков           50 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 3 одинаковых числа и 2 других одинаковых числа                                 80 очков           90 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 4 одинаковых числа                                                            160 очков          170 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 5 последовательных чисел, но не обязательно по порядку расположенных           50 очков           60 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За три раза по 1 и два раза по 13                                                100 очков          110 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За числа 1, 13, 12, 11 и 10, но не обязательно по порядку расположенных          150 очков          160 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 4 единицы                                                                     200 очков          210 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------\n");

                printf("\n Чтобы вернутся в меню нажмите Enter...");

                getch();
                system("cls");
                break;

            case 2:
                printf("\n     Игра Математико - это итальянская логическая игра. Её правила довольно просты.");
                printf("\n Есть набор из 52 карточек, на которых записаны числа от 1 до 13, причем карточки с");
                printf("\n каждым из этих чисел встречаются четырежды. У игрока имеется квадратное поле");
                printf("\n с 25 клетками. Программа объявляет первое случайное число. Играющий записывает");
                printf("\n это число в одну из клеток на своем поле. Затем программа объявляет второе случайное");
                printf("\n число, играющий опять вписывают его в любую из свободных клеток своего поля и т.д.");
                printf("\n Так продолжается до тех пор, пока не будут заполнены все клетки квадрата. Результат");
                printf("\n игрока оценивается числом набранных им очков, зависящим от способа размещения чисел в");
                printf("\n клетках квадрата. Победителем считается тот, кто набирает наибольшее количество очков.");
                printf("\n Подсчет очков производится по следующей таблице:\n");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n Комбинации чисел                                                        В ряду или столбце       По диагонали");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 2 одинаковых числа                                                             10 очков           20 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 2 пары одинаковых чисел                                                        20 очков           30 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 3 одинаковых числа                                                             40 очков           50 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 3 одинаковых числа и 2 других одинаковых числа                                 80 очков           90 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 4 одинаковых числа                                                            160 очков          170 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 5 последовательных чисел, но не обязательно по порядку расположенных           50 очков           60 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За три раза по 1 и два раза по 13                                                100 очков          110 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За числа 1, 13, 12, 11 и 10, но не обязательно по порядку расположенных          150 очков          160 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------");
                printf("\n За 4 единицы                                                                     200 очков          210 очков");
                printf("\n----------------------------------------------------------------------------------------------------------------\n");

                printf("\n Чтобы вернутся в меню нажмите Enter...");

                getch();
                system("cls");
                break;

            case 3:
                exit(0);

            default:
                printf("\n Неверная операция\n");
                getch();
                system("cls");
                break;
        }
    }

    getch();
    return 0;
}
